(function($){
	
	M.common = {
		실버라이트용: "실버라이트용"	
	};

	M.common.btn = {
		조회: "조회",
		초기화: "초기화",
		닫기: "닫기",
		확인: "확인"
	};
	
	M.common.calendar = {
		실버라이트용: "실버라이트용",
		달력: "달력",
		년: "년",
		월: "월",
		일: "일",
		시: "시",
		분: "분",
		이전달: "이전달",
		다음달: "다음달",
		일요일: "일",
		월요일: "월",
		화요일: "화",
		수요일: "수",
		목요일: "목",
		금요일: "금",
		토요일: "토",
		종료일지정안함: "종료일 지정안함",
		오늘 : "오늘",
		요일 : "요일",
		달력요일일 :"달력-요일, 일"
	};
	
	M.common.message = {
		//처리 확인 메시지
	    처리하시겠습니까: "처리하시겠습니까?",
		등록하시겠습니까: "등록하시겠습니까?",
		수정하시겠습니까: "수정하시겠습니까?",
		삭제하시겠습니까: "삭제하시겠습니까?",
		저장하시겠습니까: "저장하시겠습니까?",
		승인하시겠습니까: "승인하시겠습니까?",
		승인요청하시겠습니까: "승인요청하시겠습니까?",
		다운로드하시겠습니까: "다운로드하시겠습니까?",
		
		//처리 결과 메시지
		처리되었습니다: "처리되었습니다.",
	    등록되었습니다: "등록되었습니다.",
	    수정되었습니다: "수정되었습니다.",
	    삭제되었습니다: "삭제되었습니다.",
	    저장되었습니다: "저장되었습니다.",
	    승인되었습니다: "승인되었습니다.",
	    승인요청되었습니다: "승인요청되었습니다.",
	    
	    //각종 공통메시지
		날짜필드가아닙니다: "날짜 필드가 아닙니다.",
		날짜형식이올바르지않습니다:"날짜 형식이 올바르지 않습니다.",
		형식으로입력해주십시요:"형식으로 입력해 주십시요",
		숫자만입력가능합니다:"숫자만 입력 가능합니다.",
	    이메일주소를입력해주십시오:"이메일주소를 입력해주십시오.",
	    잘못된호출로인하여xhr을실행할수없습니다: "잘못된 호출로 인하여 xhr을 실행 할 수없습니다. function 형식으로 Array 리턴하여 주십시요.",
		헤더정보가올바르지않습니다: "헤더 정보가 올바르지 않습니다."
	};
})(jQuery);