(function($){
	M.grid = {
		주문번호    : "주문번호",  
		상품순번    : "상품순번",  
		사이트      : "사이트",    
		주문자      : "주문자",    
		상품번호    : "상품번호",  
		상품명      : "상품명",    
		옵션명      : "옵션명",    
		주문        : "주문",      
		취소        : "취소",      
		반품        : "반품",      
		주문상태    : "주문상태",  
		판매금액    : "판매금액",  
		판매단가    : "판매단가",  
		수취인정보  : "수취인정보",
		업체정보    : "업체정보",  
		로그인ID    : "로그인ID",  
		주문매체    : "주문매체",  
		주문유형    : "주문유형",  
		채널        : "채널",      
		선물포장    : "선물포장"  
	};
})(jQuery);